Creation and inspection

In [2]:
import numpy as np 
import pandas as pd

In [4]:
s = pd.Series([10, 20, 30, 40], index = ['a', 'b', 'c', 'd'])
s

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
data = {"Prn" : [101, 102, 103], "Name": ["John", "Doe", "Mark"], "Age" : [20, 21, 49], "City": ["New York", "Los Angeles", "Chicago"]}
df = pd.DataFrame(data)
df

   Prn  Name  Age         City
0  101  John   20     New York
1  102   Doe   21  Los Angeles
2  103  Mark   49      Chicago

In [16]:
arr = np.array([[1,2], [3,4]])
df1 = pd.DataFrame(arr, columns=['A', 'B'])
df1

   A  B
0  1  2
1  3  4

Inspection

In [18]:
df.head()

   Prn  Name  Age         City
0  101  John   20     New York
1  102   Doe   21  Los Angeles
2  103  Mark   49      Chicago

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Prn     3 non-null      int64
 1   Name    3 non-null      object
 2   Age     3 non-null      int64
 3   City    3 non-null      object
dtypes: int64(2), object(2)
memory usage: 228.0+ bytes

In [20]:
df.describe()

         Prn        Age
count    3.0   3.000000
mean   102.0  30.000000
std      1.0  16.462078
min    101.0  20.000000
25%    101.5  20.500000
50%    102.0  21.000000
75%    102.5  35.000000
max    103.0  49.000000

In [21]:
df.columns

Index(['Prn', 'Name', 'Age', 'City'], dtype='object')

In [25]:
df[df["Age"] > 20]

   Prn  Name  Age         City
1  102   Doe   21  Los Angeles
2  103  Mark   49      Chicago

In [27]:
df = pd.DataFrame({
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 60000, 55000, 65000, 70000],
    'Years': [2, 3, 1, 4, 2]
})
print(df)

  Department Employee  Salary  Years
0      Sales    Alice   50000      2
1      Sales      Bob   60000      3
2         HR  Charlie   55000      1
3         HR    David   65000      4
4         IT      Eve   70000      2

In [28]:
# Group by Department
grouped = df.groupby('Department')

# Basic aggregation
print(grouped['Salary'].mean())  # Average salary per department

# Multiple aggregations
print(grouped['Salary'].agg(['mean', 'sum']))

Department
HR       60000.0
IT       70000.0
Sales    55000.0
Name: Salary, dtype: float64
               mean     sum
Department
HR          60000.0  120000
IT          70000.0   70000
Sales       55000.0  110000

merging

In [29]:
# Sample DataFrames
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
})

df2 = pd.DataFrame({
    'ID': [1, 2, 3, 5],
    'Salary': [50000, 60000, 75000, 80000]
})

In [30]:
inner_merge = pd.merge(df1, df2, on='ID', how='inner')
inner_merge

   ID     Name  Age  Salary
0   1    Alice   25   50000
1   2      Bob   30   60000
2   3  Charlie   35   75000

In [31]:
left_merge = pd.merge(df1, df2, on='ID', how='left')
left_merge

   ID     Name  Age   Salary
0   1    Alice   25  50000.0
1   2      Bob   30  60000.0
2   3  Charlie   35  75000.0
3   4    David   40      NaN

In [37]:
df3 = pd.DataFrame({
    'ID': [5, 6],
    'Name': ['Eve', 'Frank'],
    'Age': [45, 50]
})
vertical_concat = pd.concat([df1, df3], axis=0, ignore_index=True)
vertical_concat

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40
4   5      Eve   45
5   6    Frank   50